vvpai9/Keil/Keil_v5/ARM/Pack/.Web/GigaDevice.GD32C10x_DFP.pdsc
        <!-- *************************  Device 'GD32C103RB'  ***************************** -->
        <device Dname="GD32C103RB">
          <memory    id="IROM1"                   start="0x08000000" size="0x020000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32C10x.FLM" start="0x08000000" size="0x020000" default="1"/>
          <compile header="Device/Include/gd32c10x.h" define="GD32C10x"/>
          <debug svd="SVD/GD32C10x.svd"/>
        </device>
      
        <!-- *************************  Device 'GD32C103VB'  ***************************** -->
        <device Dname="GD32C103VB">
          <memory    id="IROM1"                   start="0x08000000" size="0x020000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32C10x.FLM" start="0x08000000" size="0x020000" default="1"/>
          <compile header="Device/Include/gd32c10x.h" define="GD32C10x "/>
          <debug svd="SVD/GD32C10x.svd"/>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
 

    <!-- Device Conditions -->
    <condition id="GD32C10x">
      <description>GigaDevice GD32C10x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32C103*[8B]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

   <!-- Device + CMSIS Conditions -->
    <condition id="GD32C10x CMSIS">
      <description>GigaDevice GD32C10x Devices and CMSIS-CORE</description>
      <accept condition="GD32C10x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GD32C10x_libopt"/>    
      <require Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="RCU"/>           
      <require Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="PMU"/>    
    </condition>

    <!-- GD32C10x STDPERIPHERALS RCU Conditions -->
    <condition id="GD32C10x STDPERIPHERALS RCU">
      <description>GigaDevice  GD32C10x Standard Peripherals Drivers with RCU</description>
      <require condition="GD32C10x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="RCU"/>
    </condition>

     <!-- GD32C10x STDPERIPHERALS MISC Conditions -->
    <condition id="GD32C10x STDPERIPHERALS MISC">
      <description>GigaDevice  GD32C10x Standard Peripherals Drivers with MISC</description>
      <require condition="GD32C10x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="MISC"/>
    </condition>

     <!-- GD32C10x STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32C10x STDPERIPHERALS EVAL">
      <description>GigaDevice  GD32C10x Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32C10x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="USART"/>
    </condition>
  </conditions>

  <components>
    <!-- GD32C10x_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="ADC" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_adc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_adc.c" attr="config" version="1.0.0" />
        </files>
    </component>

   <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="BKP" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Backup register(BKP) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_BKP
        </RTE_Components_h>
        <files>
          <!-- BKP flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_bkp.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_bkp.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="CAN" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Controller Area Network (CAN) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
        <files>
          <!-- CAN flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_can.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_can.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="CRC" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_crc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="CTC" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Clock trim controller (CTC) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CTC
        </RTE_Components_h>
        <files>
          <!-- CTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_ctc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_ctc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="DAC" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Digital-to-analog converter (DAC) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_dac.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_dac.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="DBG" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- DBG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_dbg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_dbg.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="DMA" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_dma.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="EXMC" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>External memory controller(EXMC) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXMC
        </RTE_Components_h>
        <files>
          <!-- EXMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_exmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_exmc.c" attr="config" version="1.0.0" />
        </files>
    </component>

