vvpai9/Keil/Keil_v5/ARM/Pack/.Web/GigaDevice.GD32C10x_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="EXTI" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_exti.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_exti.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="FMC" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_fmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_fmc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="FWDGT" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Free watchdog timer(FWDGT) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
        <files>
          <!-- FWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_fwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_fwdgt.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="GPIO" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_gpio.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="I2C" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_i2c.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="MISC" Cversion="1.0.0" condition="GD32C10x CMSIS">
      <description>MISC driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_misc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="PMU" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_pmu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_pmu.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="RCU" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
        <files>
          <!-- RCU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_rcu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_rcu.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="RTC" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_rtc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_rtc.c" attr="config" version="1.0.0" />
        </files>
    </component>


  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="SPI_I2S" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_spi.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="TIMER" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>TIMER driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_timer.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_timer.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="USART" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_usart.c" attr="config" version="1.0.0" />
        </files>
    </component>

