vvpai9/Keil/Keil_v5/ARM/Pack/.Web/GigaDevice.GD32C10x_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32C10x_StdPeripherals" Csub="WWDGT" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32C10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32c10x_wwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32c10x_wwdgt.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <!-- Utilities GD32C10x -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32C10x" Cversion="1.0.0" condition="GD32C10x STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32c10x_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32c10x_eval.c" attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Config GD32C10x -->
    <component Cclass="Device" Cgroup="GD32C10x_libopt" Cversion="1.0.0" condition="GD32C10x CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/gd32c10x_libopt.h"/>
      </files>
    </component>

   <!-- Startup GD32C10x  -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="1.0.0" condition="GD32C10x">
      <description>System Startup for GigaDevice GD32C10x  Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32c10x.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32c10x.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32c10x.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>

</package>
